tap "armmbed/formulae"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "openssl@3"
brew "ansible"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "bat"
brew "bazel"
brew "gcc"
brew "binwalk"
brew "bison"
brew "cmake"
brew "diff-so-fancy"
brew "unbound"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "gh"
brew "ghostscript"
brew "git"
brew "go"
brew "openjdk"
brew "gradle"
brew "htop"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "kubectx"
brew "lazygit"
brew "libusb"
brew "libnfc"
brew "llvm@17"
brew "lua"
brew "luarocks"
brew "make"
brew "mas"
brew "maven"
brew "mfoc"
brew "minicom"
brew "yt-dlp"
brew "mpv"
brew "nano"
brew "neovim"
brew "nmap"
brew "open-ocd"
brew "pandoc"
brew "pkg-config"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-tk@3.11"
brew "python@3.10"
brew "qemu"
brew "redis"
brew "rsync"
brew "ruby"
brew "rust"
brew "scrcpy"
brew "speedtest-cli"
brew "telnet"
brew "texinfo"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "armmbed/formulae/arm-none-eabi-gcc"
cask "alt-tab"
cask "android-platform-tools"
cask "appcleaner"
cask "balenaetcher"
cask "calibre"
cask "clipy"
cask "cyberduck"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "gcc-arm-embedded"
cask "ghidra"
cask "github"
cask "google-chrome"
cask "handbrake"
cask "imhex"
cask "iterm2"
cask "jellyfin-media-player"
cask "jetbrains-toolbox"
cask "kap"
cask "kicad"
cask "nextcloud"
cask "obs"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "r"
cask "rectangle"
cask "rstudio"
cask "rustdesk"
cask "sf-symbols"
cask "sourcetree"
cask "spotify"
cask "stats"
cask "tor-browser"
cask "transmission"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "zotero"
mas "Amphetamine", id: 937984704
mas "Brother P-touch Editor", id: 1453365242
mas "HextEdit", id: 1557247094
mas "Keynote", id: 409183694
mas "The Unarchiver", id: 425424353
mas "Today", id: 6443714928
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hermitter.oh-lucy-vscode"
vscode "jasonnutter.vscode-codeowners"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "nhoizey.gremlins"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.console-ninja"
vscode "wix.vscode-import-cost"
