tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "ansible"
brew "aom"
brew "automake"
brew "bat"
brew "bazel"
brew "bison"
brew "cmake"
brew "diff-so-fancy"
brew "ffmpeg"
brew "fnm"
brew "gcc"
brew "git"
brew "go"
brew "gradle"
brew "htop"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libusb"
brew "libnfc"
brew "lua"
brew "luarocks"
brew "make"
brew "mas"
brew "openjdk"
brew "maven"
brew "mfoc"
brew "nano"
brew "neovim"
brew "nmap"
brew "open-ocd"
brew "openssl@3"
brew "pandoc"
brew "pkg-config"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "qemu"
brew "rsync"
brew "ruby"
brew "rust"
brew "scrcpy"
brew "smartmontools"
brew "speedtest-cli"
brew "telnet"
brew "texinfo"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zsh"
cask "android-platform-tools"
cask "android-sdk"
cask "appcleaner"
cask "balenaetcher"
cask "clipy"
cask "cyberduck"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "gcc-arm-embedded"
cask "github"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "jellyfin-media-player"
cask "jetbrains-toolbox"
cask "kap"
cask "kicad"
cask "mpv"
cask "nextcloud"
cask "obs"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "r"
cask "rectangle"
cask "rstudio"
cask "rustdesk"
cask "sourcetree"
cask "spotify"
cask "stats"
cask "tor-browser"
cask "transmission"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
mas "Amphetamine", id: 937984704
mas "Brother P-touch Editor", id: 1453365242
mas "HextEdit", id: 1557247094
mas "Keynote", id: 409183694
mas "MeetingBar", id: 1532419400
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
